; domain
(define (domain taxi_domain1)
    (:requirements :adl :typing :negative-preconditions :action-costs)
    (:types passenger - object  location - object)
    (:predicates 
        (road ?l1 ?l2 - location)
        (trafficLight ?l1 ?l2 - location)
        (taxiAt ?l - location)
        (passengerAt ?p - passenger ?l - location)
        (requestFrom ?p - passenger ?l - location)
        (requestTo ?p - passenger ?l - location)
        (onTaxi ?p - passenger)
        (congested ?l - location)
        (fullBattery)
        (emptybattery)
        (halfBattery)
        (quarterBattery)
    )
    (:action move
        :parameters (?l1 ?l2 - location)
        :precondition(and(taxiAt ?l1)
                        (road ?l1 ?l2)
                    )
        :effect(and(taxiAt ?l2)
                    (not(taxiAt ?l1))
                )
    )
    (:action pickUp
        :parameters(?p - passenger ?l - location)   
        :precondition(and(requestFrom ?p ?l) 
                        (passengerAt ?p ?l)
                        (taxiAt ?l)
                        (forall(?p1 - passenger)(not(onTaxi ?p1)))                            
                    ) 
        :effect(and(not(passengerAt ?p ?l))
                    (onTaxi ?p)
                    (not(requestFrom ?p ?l))
                )
    )
    (:action getOff
        :parameters(?p - passenger ?l - location)
        :precondition(and(onTaxi ?p)
                        (taxiAt ?l)
                        (requestTo ?p ?l)
                    )
        :effect(and(not(onTaxi ?p))
                    (passengerAt ?p ?l)
                    (not (requestTo ?p ?l))
                )
    )

)

; problem
(define (problem taxi_problem1)
    (:domain taxi_domain1)
    (:objects p1 - passenger
              p2 - passenger
              l1 - location
              l2 - location
              l3 - location) 
    (:init
        (road l1 l2)
        (road l2 l1)
        (road l2 l3)
        (road l3 l2)
        (passengerAt p1 l1)
        (passengerAt p2 l1)
        (taxiAt l2)
        (requestTo p1 l3)
        (requestFrom p1 l1)
        (= (total-cost) 0)

    )
    (:goal 
            (passengerAt p1 l3)
    )
    (:metric minimize (total-cost))
)

; plan
1. (move l2 l1)
   deleted: (taxiat l2)
   added: (taxiat l1)
   goals met: 0 of 1
2. (pickup p1 l1)
   deleted: (passengerat p1 l1) (requestfrom p1 l1)
   added: (ontaxi p1)
   goals met: 0 of 1
3. (move l1 l2)
   deleted: (taxiat l1)
   added: (taxiat l2)
   goals met: 0 of 1
4. (move l2 l3)
   deleted: (taxiat l2)
   added: (taxiat l3)
   goals met: 0 of 1
5. (getoff p1 l3)
   deleted: (ontaxi p1) (requestto p1 l3)
   added: (passengerat p1 l3)
   goals met: 1 of 1
